Revit API Introduction Labs
FormUtils.MakeCurve Method
 Create a CurveByPoints element by three given points
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public static CurveByPoints MakeCurve(
	FamilyItemFactory creator,
	XYZ pa,
	XYZ pb,
	XYZ pc
)
Visual Basic (Declaration)
Public Shared Function MakeCurve ( _
	creator As FamilyItemFactory, _
	pa As XYZ, _
	pb As XYZ, _
	pc As XYZ _
) As CurveByPoints
Visual C++
public:
static CurveByPoints^ MakeCurve(
	FamilyItemFactory^ creator,
	XYZ^ pa,
	XYZ^ pb,
	XYZ^ pc
)
Parameters
creator
Type: FamilyItemFactory
pa
Type: XYZ
pb
Type: XYZ
pc
Type: XYZ
See Also
FormUtils Class
Labs Namespace